[
  {
    "id": "if-you-could-redesign-the-schooling-system",
    "title": "If you could redesign the schooling system, what would you include that you were never taught?",
    "date": "2021-03-15",
    "excerpt": "13 years ago I finished school, and 13 years ago I wished I could see \"A day in the life of\" for every occupation that existed at the time. This would have given me a glimpse into the reality that is the workplace environment that people don't know until they know!",
    "content": "**From Nic Haralambous:**\n\nIf you could redesign the schooling system, what would you include that you were never taught?\n\nI'll go first:\n\nI wish I was taught about money:\n- How to save it\n- How to spend it\n- How to grow it\n- How it works in the world\n- Where it comes from and where it goes\n\nI would want to teach kids the practicality of money in the real world, accounting for real life, budgeting for a household.\n\nComment below with yours!\n\n#leadershipfirst #entrepreneur #mindset\n\n---\n\nLinkedIn's got a character limit and because of this, I was forced to split my reply into three, which obviously left it hard to piece together and therefore difficult to read.\n\nNic suggested I delete and re-write (in fewer characters), but in this case, if the shoe doesn't fit, don't wear it - I don't do short-form…anything, so now we're here 😊\n\n---\n\n**My reply:**\n\n13 years ago I finished school, and 13 years ago I wished I could see \"A day in the life of\" for every occupation that existed at the time. This would have given me a glimpse into the reality that is the workplace environment that people don't know until they know! (I feel like that's where mid-life crises come from)\n\n13 years ago I created a platform called My Start in Life, that would aim to Inspire | Motivate | Educate high schoolers on what life after school was like.\n\n**Inspiration:**\n1. Success stories from people that had \"made it\" in their respective field (plumber, botanist, the pool guy - he's an entrepreneur but no-one highlights that);\n2. ...\n\n**Motivation:**\nGive them something to look forward to, something to push themselves for.\n1. Insight into a day in the life of {allCareers} after taking them through simple tests that gauge their interests, strengths and weaknesses (these change of course, but think: starting point) and then guide them through a personalised journey of discovery;\n2. Why, what, where and if to study (in that order);\n3. ...\n\n**Education:**\n> \"A base layer\"\n1. Teach them all about financial education in ways that would interest them, like \"How to save for that pair of sneakers you want to buy\";\n2. How and why to set goals;\n3. How to stay mentally and physically fit;\n4. Mentorship programmes and where to find them;\n5. ...\n\nI was so passionate about this platform I had envisioned and tried to put together many many times, but I found the task a tedious one - too big for one young guy (or two at times)!\n\nFor the next few years, I'd be riddled with sleepless nights (seriously, for long periods of time), lots of learning by trial and error, lots of exposing myself to people that were decades my senior, in the hopes someone would latch on and just take this burden from me.\n\nLong story short:\n- Had hundreds of conversations about this platform/attitude/way of life;\n- Convinced many people;\n- Nearly got funded twice;\n- Learned all the skills I have now, that were needed to get me going then;\n- Became a Product of my platform;\n\nCan it be replicated? **Maybe**\n\nI still feel it's super relevant, and I'd love to do something about it.\n\nI told my friends 3 years out of school, that if I was still talking about this in the next 3 years that they should stop being friends with me - they stuck around, but its been many years on…still talking about it 😃\n\n**Nic Haralambous** when I saw your post about the young dude that created a co-working environment with simple materials so his peers could have access to the internet I was very excited!\n\nOne of the biggest threats to my platform back then, was that it was not only for schools or kids that had access to the internet, but it would be for everyone (in hindsight, that's probably too large of a segment) and not everyone had access to the internet, especially in impoverished areas.\n\nI believed though, that I needn't solve all of my problems alone, but that once kids were Inspired, Motivated, Educated - I could leave it up to them to realise their entrepreneurial brilliance and someone, somewhere would eventually do what that young man has just done - they'd do the thing!\n\n**To conclude:**\n\nI wish I was told that I could do and be ANYTHING, and then shown what ANYTHING looked like.\n\n😊\n\n---\n\nThanks for reading\n\nBe kind. Be helpful. Be useful",
    "tags": ["thoughts", "response", "education", "inspiration", "motivation"],
    "url": "https://www.bucklemeshoe.com/thoughts/if-you-could-redesign-the-schooling-system-what-would-you-include-that-you-were-never-taught"
  },
  {
    "id": "learn-more-by-reading-more-job-specs",
    "title": "Learn more by reading more job specifications",
    "date": "2021-03-30",
    "excerpt": "Job specs, much like coriander are things (for lack of a better word) we either love, or we hate. Good job specs are the perfect opportunity for you to find out what the industry is looking for.",
    "content": "Job specs, much like coriander are things (for lack of a better word) we either love, or we hate.\n\nWe love when it speaks to our exact set of skills. We love when it calls for us to do things we've done hundreds of times before - \"done it before, will do it again\" or \"I can do that with my eyes closed\". We get excited when the cherry on top of it all, is a bunch of perks that we've always wished we might have, if we get the job!\n\nIn another comparison (because why not), much like horoscopes, job specs are sometimes quite generic, and at times when they just seems to line up exactly how we want it to, and to keep with the analogy - \"the stars align\".\n\n**Note**: I do acknowledge that these specs are often just conversation starters.\n\nIn reality though, all specs were not made equal and in fact, some are very badly written. More often it does not fully describe what you'll actually be doing, because let's face it, as a UXer and not dissimilar with any design discipline that involves figuring things out, you'll be tasked to do just that - \"figure things out\".\n\n### Let's talk about when we hate job specs\n\nThe obvious one is - we hate job specs that ask way too much of us, those that describe four job roles in one, are spread over three A4 digital pieces of paper. We also hate job specs when they challenge us; when it challenges what we know. We go on the defence, we quickly lose our enthusiasm, and it often triggers a visceral effect - almost inciting nerves causing rosy cheeks for some and general heat under the collar (overboard-ly expressive I know, but you get my drift) for others.\n\n> We also hate job specs when it challenges us; when it challenges what we know\n\nThis is a normal human reaction, to something that challenges us. We make excuses for why where we are right now is exactly where we need to be and we might even just go quiet on the person that sent us the spec because silence is better than acknowledging defeat, right?\n\n### Why not accept the challenge as an opportunity to level up?\n\nAt the point of reading the spec, there is no commitment from either side, neither yours nor the recruiter/talent scout - or whatever fancy name is being used in 2021 to describe the person trying to place you.\n\nAll in the name of being overly dramatic, watch Will Smith explain why you cannot be afraid of jumping out of a plane if you've not yet jumped out of a plane. [Watch that >](https://www.youtube.com/watch?v=gG-F_rRVdLc)\n\nGood job specs are the perfect opportunity for you to find out what the industry is looking for. A well-crafted job spec, if nothing else provides you, at no charge, with the structure (*thank you Company-X*) for a course you can follow to mould yourself into a more challenge-accepting-designer.\n\nBreak down the spec into a few sections:\n1. What is the industry?\n2. How long has it/have they (company and industry) been around?\n3. What problems are they solving?\n4. How do they solve problems?\n5. What skills do they have?\n6. Which skills are they hiring?\n7. As it has got to be a mutual exchange, what do they offer in return for these skills?\n\nRead 10 specs, then read 10 more and before you know it, not only will this have given you the best understanding of what's out there for the next time you need a refresher but you'll more easily be able to \"read\" the company you are applying to, in order to understand them better. Now knowing what you like and dislike, you'll also be better equipped to make the right decisions when it's time for you to make your move - but most importantly, for every spec you've read that left you feeling inadequate and challenged, you'll have another opportunity to hone in on what you don't know, and level the bleep (bleep) up!\n\nThanks for reading\n\nBe kind. Be helpful. Be useful\n\np.s. I am trying something new. I'm trying my hand at shorter pieces and hoping they make as much sense as I think my longer-form posts do. If you've not read anything I've written before, for context, I encourage you to do so and please - give me feedback or start a conversation.",
    "tags": ["recruitment", "design"],
    "url": "https://www.bucklemeshoe.com/thoughts/learn-more-by-reading-more-job-specs"
  },
  {
    "id": "a-story-of-the-state-of-business-in-2021",
    "title": "A Story of the State of Business in 2021!",
    "date": "2021-05-17",
    "excerpt": "It's 2021, and my mate speaks for weeks about a pair of shoes he really really wants/needs. A story about customer service, business standards, and the modern marketplace.",
    "content": "It's 2021, and my mate speaks for weeks about a pair of shoes he really really wants/needs. Full disclosure up front: My friend runs more kilometers per week than I put on my car and more than most people run per year (more on that later) so, he is a serious runner.\n\nSerious runners need serious shoes. He told me he found the pair he wanted, online but he really wanted to try them on first - the old try before you buy.\n\nThe shoes he wants are Nikes, so, excited one early morning he heads to the Nike store at the Waterfront. Upon entering he's greeted by a masked figure holding out a spray bottle of sanitizer (the norm at this point). After the formalities were over, knowing exactly what he was looking for, he asked the figure (let's call her Amy) if they had the shoes in stock, and in his size. He, excited as can be was met with a **\"we don't have your size\"**. At that point, he enquires whether or not any of the other branches might have his size. His question this time met with an **\"I'm not sure, but Canal Walk might have because they are a bigger store\"**.\n\nRight now Amy's got a choice to make, she can 1) Make zero effort to push a sale through her books, or 2) Make this happen.\n\nSide note: I feel it take more to provide a shitty experience vs, doing just a few things right to make for a good one.\n\nHe prompts her to call Canal Walk to enquire, Amy obliges and he's told that they do have his size but not having a car makes this a mission impossible. *Remember the instant gratification scale is tipping slowly in the opposite direction, and that's basically the one true thing fuelling everything we do these days.*\n\nAnother Side note: I am well aware that the store not having stock of this shoe in his size is not directly Amy's fault, but if you think hard and long, somewhere, somehow she and every other staff member working in or behind the scenes of that store - they've got a part to play.\n\nThey're just about to lose a sale when he enquires about whether there was another shoe that could compare or match up to the one he came in for. This of course a tricky question for most (or at least we've gotten used to this outcome), but surely in a Nike store, staff would be trained on, well Nike products?!\n\nNo inquiry into why he was going for a trail shoe in the first place when in reality (and only he knows this) he does 90% of his running on the road. She had no knowledge of a pair of shoes that could create a similar or better experience, even if they were more expensive.\n\nDefeated, he leaves.\n\n> We can't continue the narrative that all businesses are suffering right now, it's 2021 - you're going to have to do one better than what everyone else is doing. As individuals, you're going to have to learn more about what you're doing, selling, promoting so that in store, outside or wherever you are, you are domain expert so when people \"step into your office\" - they know and you know \"You got this!\"\n\nThat - knowing enough (or everything) about what you're doing, selling, promoting is the first step in creating/crafting a memorable experience.\n\nMy friend turned to [Superbalist](https://superbalist.com/) to buy his shoes.\n\n**Benefits:**\n- It was cheaper!!!\n- They had his size and preferred colorway\n- He was able to pay it off (why not) using PayFlex (that review coming soon…)\n- Zero barrier to entry bringing the sunshine, on a Tuesday that started off slightly gloomier.\n\n**Drawbacks:**\n- No instant gratification (he still has to wait a day for the shoes)\n\nFor just anybody (a new or casual runner) this might have been ok. But for an enthusiast (think, enthusiast of anything) someone that wakes up knowing the only way - is out, outside, come rain or shine, this won't do!\n\n### It's 2021\n\nYears before one might have gotten away with \"he is a minority\". In this context and without knowing the real numbers, take me with a brick of salt here, but I don't think this is the case any longer.\n\nIt's 2021, mate - why shouldn't he have his cake and eat it too?\n\nWhy was the experience inside the Nike store, worse than the wonderful buy now, pay later experience he had online with Superbalist? Yes, they've got a dope team, dedicated to creating experiences that are more than memorable that they want you to speak about, and I am. Why did the brand, that basically paved the way for other companies (related and not) through amazing products and product experiences - why did they fail in comparison this time?\n\nBad business (will leave this here)…",
    "tags": ["business", "customer service", "retail"],
    "url": "https://www.bucklemeshoe.com/thoughts/a-story-of-the-state-of-business-in-2021"
  },
  {
    "id": "money-is-an-extrinsic-motivator",
    "title": "Money is an extrinsic motivator, always will be...",
    "date": "2021-05-18",
    "excerpt": "As a precursor to my post titled \"How I calculated my new hourly rate\". Some people may know already, but for others, it might be the first time you hear this - money is an extrinsic motivator.",
    "content": "As a precursor to my post titled \"How I calculated my new hourly rate\".\n\n**Have I earned more before?** Yes\n**Could I earn more?** Yes\n**Do I want to earn more?** Not necessarily\n\nSome people may know already, but for others, it might be the first time you hear this - money is an *extrinsic motivator*.\n\nLet's chat about what that means… here's a little story to help.\n\n---\n\nIt's been about two or three years now and you've found a rhythm in getting up, and getting yourself to work. Your morning routine - impeccable; your coffee stops - vital, and your timing - well you've got that down pat.\n\nYou're really good at what you do, so the job's great, the people are too and you are right where you thought you'd be at this point in your life.\n\nOne day you get an InMail from a Recruiter - this time, this one stands out though, it's not just the standard \"Hey, I've got a job - you want a job?\". It's a well-crafted, well thought out, personalized offer that entices you to find out more - so you do.\n\nAfter a few messages are shared, the Recruiter tells you there's an opportunity to earn X - which is your current salary plus 35%.\n\n**This is what happens in your brain:**\n- You get excited at the prospects of earning more money; then\n- You start spending that money in your head;\n- You start justifying why you need the extra money;\n- You start comparing your current salary to your potential new one;\n- You start feeling like you're just not earning enough; and\n- You start to wonder if coffee runs and cool people are everything;\n- Your newfound motivation - a currency, which you'll also use to get yourself those new wheels you've been dreaming of (or have you just now created this dream?).\n\nNow, with clouded judgment (let's speed this along), out with the old as you start your first day at your new place of work.\n\nYou are so excited about the parking bay you were given, the massive bowl of bananas you now have access to at no cost, and all the other shiny things in the office (people, things, feelings).\n\n**Fast forward three months—**\n\nYou're just about flowing with your current team, your line manager isn't as sharp as he/she was in the interview, but it's not that bad. The early morning drive into the office, although only twice a week is a bit tedious and the view from the window next to your desk - average, but the grunt of your new GTi makes up for it all.\n\nIt's the start of the fourth month and while at the office your phone lights up -\n\n**NOTIFICATION, notification, NOTIFICATION!**\n\nAll your monthly debits go off and you're baffled because you realize that you've now actually got less money than you usually had before, around the same time of the month.\n\nPuzzled, you check your bank account and the numbers just don't make sense.\n\n**Let's examine what happened:**\n\nYou got more money, therefore you were taxed more. The new parking bay you received also came as part of your CTC (cost-to-company), and the fancy car you park in that bay too. You bought some new gear for your first day, (maybe you didn't need that new laptop bag with the built-in charger). At home, you added a few subscriptions, got a faster internet line, and took out a gym contract so your mom could join your sister for spin class on Tuesdays and Thursdays - sweet.\n\nAs your income increased, so did your expenses.\n\nYou're back to square one, yet now you don't have your old but awesome colleagues: because your commute is a bit further you've lost some of your routines, and although your new desk setup at home is sleek, you recognize that the Slack group labeled \"general\" is just not as fun as it used to be.\n\nYou've lost your motivation (a currency) and you've lost your motivation.\n\nIf you're here but still don't get it, [extrinsic motivation](https://www.verywellmind.com/differences-between-extrinsic-and-intrinsic-motivation-2795384) refers to behaviors that are influenced by external rewards (praise, fame or money).\n\nThese rewards will come and go and are influenced by a number of factors, often out of our control and therefore we face being left worse off than when we started.\n\n**The goal:** find something that gets you sprung out of bed in the morning, find the thing that puts a pep in your step, do that thing that lights the fire within you (and now that all the metaphors are out the way), do something that helps someone else achieve their dreams, etc.\n\nAlong the way, you'll have discovered what intrinsically (solely for personal enjoyment or personal satisfaction) motivates you - try it, you might just love it.\n\nThanks for reading\n\nBe kind. Be helpful. Be useful",
    "tags": ["motivation", "career", "money", "psychology"],
    "url": "https://www.bucklemeshoe.com/thoughts/money-is-an-extrinsic-motivator-always-will-be"
  }
]