[
  {
    "id": 1,
    "name": "Kevin Tucker",
    "position": "Founder & CEO",
    "company": "Pricecheck, Shopping Feeder",
    "email": "kevin@pricecheck.co.za",
    "phone": "+27 21 123 4567",
    "image": "/images/team/Kevin+Tucker.png",
    "linkedinUrl": "https://linkedin.com/in/kevintucker",
    "testimonial": "I commissioned Jared for a project to rethink our UX and redesign our site in a minimalist, performant, user-friendly way. He spent time doing research and really understanding our needs. He then worked extremely quickly, efficiently and collaboratively to roll out wireframes and prototypes that we could analyse and debate and decide on best-in-class. The great thing was that he 'just got it' - I didn't have to explain the underlying business needs or the user-imperatives at great length, which made the rapid delivery of the project that much easier to achieve. I will be working with Jared regularly going forward.",
    "relationship": "Former Client",
    "project": "UX Redesign & Site Optimization",
    "date": "2019-2020"
  },
  {
    "id": 2,
    "name": "Juliette Crouzet-Mertens",
    "position": "Global & France Brand Engagement Lead",
    "company": "Unilever",
    "email": "juliette.crouzet@unilever.com",
    "phone": "+33 1 23 45 67 89",
    "image": "/images/team/juliette+1.png",
    "linkedinUrl": "https://linkedin.com/in/juliettecrouzet",
    "testimonial": "Jared has done an amazing job at developing our new e-commerce & brand website for Maille, going above and beyond to ensure we have the perfect customer experience, and re-designing the consumer journey in an impactful way. We have had significant improvement in terms of engagement since the launch. I highly recommend working with him!",
    "relationship": "Former Client",
    "project": "Maille E-commerce & Brand Website",
    "date": "2020-2021"
  },
  {
    "id": 3,
    "name": "Martijn Wijsmuller",
    "position": "Founder & Commercial Director",
    "company": "Ask Phil",
    "email": "martijn@askphil.com",
    "phone": "+31 20 123 4567",
    "image": "/images/team/chris.png",
    "linkedinUrl": "https://linkedin.com/in/martijnwijsmuller",
    "testimonial": "Jared is a great person to work with, he has shown a professional and extremely engaged work ethic. I first met with Jared over Google Meets in December of 2019. His client was in a crisis and he came to Ask Phill for e-commerce development help. He did his due diligence, asking the right questions to ensure Ask Phil was a good fit for his client and even flew out to Amsterdam to meet me in person. He was professional in introducing me to his client and also assisted in making sure that the deal was sweet for both parties. Finally, he periodically checked in to make sure everything was going and had gone smoothly with the project. Jared was a pleasure to work with and incase you have any questions feel free to reach out.",
    "relationship": "Business Partner",
    "project": "E-commerce Development Partnership",
    "date": "2019-2020"
  },
  {
    "id": 4,
    "name": "Shane Ramiah",
    "position": "Senior Dev",
    "company": "PartnerPage",
    "email": "shane@partnerpage.com",
    "phone": "+27 11 234 5678",
    "image": "/images/team/shane_ramiah+1.png",
    "linkedinUrl": "https://linkedin.com/in/shaneramiah",
    "testimonial": "I had the pleasure of working with Jared at PartnerPage, who also help me in obtaining the job at the company. He recommended me for a position which fits my profile as he understood my technical skills since we also worked in a previous company together. Jared is a brilliant and gifted Product Designer but also someone who really understands how to acquire talents. I highly recommend Jared if you need to get the job done.",
    "relationship": "Former Colleague",
    "project": "Product Design & Team Building",
    "date": "2018-2019"
  },
  {
    "id": 5,
    "name": "Thomas Du Preez",
    "position": "UI/UX Designer",
    "company": "The Delta Studio",
    "email": "thomas@deltastudio.co.za",
    "phone": "+27 21 345 6789",
    "image": "/images/team/thomas_du_preez+1.png",
    "linkedinUrl": "https://linkedin.com/in/thomasdupreez",
    "testimonial": "I met Jared at a time I was struggling to figure out what my future in terms of careers would be and I cannot express how grateful I am that we got chatting that day! It's through Jared that I can be thankful for helping me officially get my foot in the tech industry, not only did he help me start my journey but I got to do this in Mauritius alongside him starting out as a software tester! This is where I got my first true experience of all the roles that make up a tech team, one of them being UX/UI design which sparked my interest. Through this amazing opportunity, some further education and much needed advise from Jared I followed a passion for UX/UI design and now find myself working for a design company full time with about 2 years under my belt. Jared is a great person, full of positive energy, a definite sense of humor and a great friend. Jared would be an asset to any team and definitely earns my highest recommendation!",
    "relationship": "Mentee",
    "project": "Career Mentorship & UX/UI Training",
    "date": "2017-2019"
  },
  {
    "id": 6,
    "name": "Chris Malherbe",
    "position": "Head of Development",
    "company": "Voyya.com",
    "email": "chris@voyya.com",
    "phone": "+27 21 456 7890",
    "image": "/images/team/chris.png",
    "linkedinUrl": "https://linkedin.com/in/chrismalherbe",
    "testimonial": "Jared is a huge asset at Voyya.com. With his in-depth knowledge of user experience and the travel industry he has shaped our offering and business strategy to be more focused on the individual and ultimately making us more successful. Jared has added a modern feel to our product and ensured that we are on par with other big players in the industry. He has also done a lot of user research on our clients, to ensure we are solving their pain points. He has great interpersonal skills and brings an infections energy to the team. He is a joy to work with, and is committed and a hard working individual. Jared has also introduced juniors into the team and mentored them on how the technology industry works, showed them where to get started and taught them the basics of UI and UX design.",
    "relationship": "Former Colleague",
    "project": "Travel Industry UX Strategy",
    "date": "2017-2019"
  },
  {
    "id": 7,
    "name": "Gavin Marchbank",
    "position": "User Experience Research Lead",
    "company": "FMI",
    "email": "gavin@fmi.com",
    "phone": "+27 21 567 8901",
    "image": "/images/team/gavin.jpeg",
    "linkedinUrl": "https://linkedin.com/in/gavinmarchbank",
    "testimonial": "I had the privilege of working with Jared in my capacity as the User Experience Researcher at PriceCheck. I often found Jared to be the one who most-readily drew insights from my work. He is brilliant at taking the business requirements and user research and designing a truly user-centered experience that meets the needs of the business. I am certain that this is a result of his dedication to transforming any and all experience around him into one that brings the utmost satisfaction for all. You don't want to work with the people who don't want to work with Jared.",
    "relationship": "Former Colleague",
    "project": "User Research & UX Design",
    "date": "2019-2020"
  },
  {
    "id": 8,
    "name": "Terri Boshoff",
    "position": "Managing Director",
    "company": "Travelogic",
    "email": "terri@travelogic.com",
    "phone": "+27 21 678 9012",
    "image": "/images/team/terri_boshoff.jpg",
    "linkedinUrl": "https://linkedin.com/in/terriboshoff",
    "testimonial": "I had the honour of working with Jared at Wetu. He came in as our first UX Designer and blew me away with his ideas and dedication to the product. We worked closely on many projects and as his knowledge of our product and industry grew, he helped us fight for and create a truly user-centred experience. Jared is a pleasure to work with, bringing character, insight and brilliant designs into every project. It would be a privilege to work with Jared again!",
    "relationship": "Former Colleague",
    "project": "Travel Industry UX Design",
    "date": "2016-2017"
  },
  {
    "id": 9,
    "name": "Sean Winter",
    "position": "CEO",
    "company": "Voyya.com",
    "email": "sean@voyya.com",
    "phone": "+27 21 789 0123",
    "image": "/images/team/sean_winter.jpg",
    "linkedinUrl": "https://linkedin.com/in/seanwinter",
    "testimonial": "Jared has been instrumental at Voyya in designing and developing a consumer-grade product for our business customers. His UI and UX skills are exceptional but above all, he is a great guy with fantastic, positive energy! This energy added tremendous value to the company in both the good and bad times and was highly appreciated by every team member who worked with him. Meticulous by nature and equipped with a wide set of skills, not only in the UX arena, Jared's is going to be sorely missed by myself and the rest of the Voyya team.",
    "relationship": "Former CEO",
    "project": "Consumer-grade Product Design",
    "date": "2017-2019"
  },
  {
    "id": 10,
    "name": "Kateryna Kniaz",
    "position": "Senior Designer",
    "company": "Tech Company",
    "email": "kateryna@company.com",
    "phone": "+44 20 123 4567",
    "image": "/images/team/kateryna_kniaz.jpg",
    "linkedinUrl": "https://linkedin.com/in/katerynakniaz",
    "testimonial": "Jared is an experienced and talented designer. He's proactive, enthusiastic and dedicated professional, his communication and time management skills are excellent. On top of that Jared is a great team player, he's capable of solving a complex problem that involves different parties including product owners, developers and QAs. I am glad to have worked with him and have no hesitation recommending him to potential employers!",
    "relationship": "Former Colleague",
    "project": "Cross-functional Design Collaboration",
    "date": "2022-2023"
  },
  {
    "id": 11,
    "name": "Jonathan Aspden",
    "position": "Project Manager",
    "company": "Business Solutions",
    "email": "jonathan@business.com",
    "phone": "+44 20 234 5678",
    "image": "/images/team/jonathan_aspden.jpg",
    "linkedinUrl": "https://linkedin.com/in/jonathanaspden",
    "testimonial": "Jared joined my project at a time where we had a large time pressure to design some major functionalities for two of our internal facing business applications. With no context of the processes or the applications he picked things up really quickly by asking the right questions and proactively spending time with the right people to KT with. Jared's design process was perfect for our needs and the end result was extremely thorough and well thought out, as well as being of extremely high quality. We wouldn't have been able to deliver key value to our business without Jared. On top of all of that he is a great person to work with, it has been an absolute pleasure and his next project is very fortunate to have him.",
    "relationship": "Former Client",
    "project": "Internal Business Applications Design",
    "date": "2023-2024"
  }
] 